app/views/cocktails/show.html.erb

<ul>
<% @cocktail.cocktail_ingredients.each do |cocktail_ingredient|%>
---
SELECT "cocktail_ingredients".* FROM "cocktail_ingredients" WHERE "cocktail_ingredients"."cocktail_id" = ?  [["cocktail_id", 4]]