bartender/app/views/ingredients/show.html.erb

<ul>
<% @ingredient.cocktails.each do |cocktail|%>
---
SELECT "cocktails".* FROM "cocktails" INNER JOIN "cocktail_ingredients" ON "cocktails"."id" = "cocktail_ingredients"."cocktail_id" WHERE "cocktail_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]