bartender/app/controllers/cocktails_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def define_current_cocktail
        if params[:id]
            @cocktail = Cocktail.find(params[:id])