bartender/app/controllers/cocktails_controller.rb

SELECT "cocktails".* FROM "cocktails" ORDER BY "cocktails"."name" ASC
---
    def index
        @cocktails = Cocktail.all.order(:name)