bartender/app/controllers/ingredients_controller.rb

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def define_current_ingredient
        if params[:id]
            @ingredient = Ingredient.find(params[:id])