bartender/app/controllers/ingredients_controller.rb

    def index
        @ingredients = Ingredient.all.order(:name)
---
SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."name" ASC